{"pages":[{"text":"Tags: plugin, ultrasonic Slug: 1d-signal-presentation Lang: en Author: worm Motivation Icy is designed for 2D+ image data processing, but in NDE, we often get 1D signal like ultrasonic waveform. The following picture shows a sample of typical ultrasonic waveform. Solution But there are a lot of plugins available on the Icy repository, and a user can alway find something they want. So I found the \"Intensity Profile\" plugin which can used a a temporary solution to show a waveform in Icy. The following picture shows the screen shot of using intensity profile to show a waveform stored as a picture with only one row pixels. Usage: 1. Input \"IntensityProfile\" in the search bar of Icy, it located in the upper left of the main window. When it appears in the search result, just click to install. 2. Open you image, we can store a waveform as a row of pixels, which also means one pixels is one sample value from your data acquisition device. Don't care much about the data range, Icy supports 32-bit gray image, which will be enough for most ADC device. 3. Then put a line ROI on the image, adjust it to the right position, you can press shift key to make it orthogonal. 4. Click \"IntensityProfile\" in the menu bar. And you will see a cure displayed in a chart window. You can zoom in and out, the chart is handled by a java chart library known as \"JfreeChart\".","tags":"blogs","loc":"wormzc.org/blogs/1d-signal-presentation-in-icy.html","title":"1D signal presentation in Icy"},{"text":"Tags: plugin, ultrasonic Slug: 1d-signal-chart-canvas Lang: en Author: worm 1D signal representation in Icy Previously, I mentioned there is no elegant way to show 1D signal in Icy, although 1D signal takes the most part NDT/NDE signal such as Ultrasonic, Eddy Current. Many imaging method is based on the analysis of 1D signal. For an instance, we should find the back wall echo in order to generate a simple C-Scan map. So show 1D signal as waveform is very important in a NDE system. But the previous method to do this is tedious, since we should put our profile line on the right position and should adjust two frames to get a better view. Operation in two frames makes the manipulation more complicated. Canvas plugin The answer is \"Canvas\", thanks Fabrice and Stephane. There is a mechanism called \"Canvas\" which is used for different type of representation of data. When you open a sequence in Icy, it will open in 2D canvas by default. And also you can shift different canvas on the top of the sequence window, for example you can expand your z-axis to make a montage view of your 3D data. Another good news is \"Canvas\" is supported in plugin developing. Then a Canvas Plugin will become an elegant way to extend Icy to support 1D signal representation. What's more, Icy itself have Jfreechart integrated in its library, which helps a lot when dealing with 1D signal GUI. The Plugin -- Chart1DCanvas After some coding work, I finally implemented a canvas plugin named Chart1DCanvas which can actually do the 1d signal representation work. This plugin will be act as a basis to the following NDE applications. Here goes a screen shot of the plugin. With this plugin, Icy will show a 1d signal in native way which actually is canvas. We can use the canvas to show all kinds of waveforms such as eddy current and ultrasonic etc.. See more detail about the plugins, see [Download][../pages/downloads].","tags":"blogs","loc":"wormzc.org/blogs/plugin-to-show-1d-signal-in-icy-is-out.html","title":"Plugin to show 1D signal in Icy is out!"},{"text":"Tags: plugin Slug: micro-manager-for-icy Lang: en Author: worm Hardware solutions for EVA Micro-manager is a powerful framework for hardware integration, is a ideal solution for EVA project to support hardwares. Micro-manager is used to support all kinds of microscopies and accessories by providing a flexiable driver adapter machanisim. For EVA project itself, we trying to include some open source hardware in order to build less-pricy research platform. We decide to use Micro-manager as a midware to bridge the hardware and the Icy software. And another reason is, Micro-Manager is fully supported in Icy, we got \"Micro-Manager for Icy\" and many other plugins can work with Micro-Manager. With Micro-Manager, all kinds of data can be represent as image. Signals in 1D can also treated as a one-row image, and the value range can be 8 bit to 64 bit, so it can represent almost every kind of signal. We will demostrate this framework with a ultrasonic imaging device.","tags":"blogs","loc":"wormzc.org/blogs/hardware-connection-with-micro-manager.html","title":"Hardware connection with Micro-Manager"}]}